Revit 2027 API
ExternalResourceType.Inequality Operator
Compares two ExternalResourceType instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator !=(
	ExternalResourceType first,
	ExternalResourceType second
)
Public Shared Operator <> (
	first As ExternalResourceType,
	second As ExternalResourceType
) As Boolean
public:
static bool operator !=(
	ExternalResourceType^ first,
	ExternalResourceType^ second
)
static let inline (<>)
        first : ExternalResourceType *
        second : ExternalResourceType  : bool
Parameters
first ExternalResourceType
The first ExternalResourceType.
second ExternalResourceType
The second ExternalResourceType.
Return Value
Boolean
True if the inputs are different, false if they are identical.
See Also
Reference
ExternalResourceType Class
Autodesk.Revit.DB Namespace